avrdudes/avr-libc/include/avr/ioavr64da48s.h
/* Channel 1 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL1_enum
{
    EVSYS_CHANNEL1_OFF_gc          = (EVSYS_CHANNEL1_OFF_gv << EVSYS_CHANNEL1_gp),  /* Off */
    EVSYS_CHANNEL1_UPDI_SYNCH_gc   = (EVSYS_CHANNEL1_UPDI_SYNCH_gv << EVSYS_CHANNEL1_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL1_RTC_OVF_gc      = (EVSYS_CHANNEL1_RTC_OVF_gv << EVSYS_CHANNEL1_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL1_RTC_CMP_gc      = (EVSYS_CHANNEL1_RTC_CMP_gv << EVSYS_CHANNEL1_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL1_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV512_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL1_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV256_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL1_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV128_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL1_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL1_RTC_PIT_DIV64_gv << EVSYS_CHANNEL1_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL1_CCL_LUT0_gc     = (EVSYS_CHANNEL1_CCL_LUT0_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL1_CCL_LUT1_gc     = (EVSYS_CHANNEL1_CCL_LUT1_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL1_CCL_LUT2_gc     = (EVSYS_CHANNEL1_CCL_LUT2_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL1_CCL_LUT3_gc     = (EVSYS_CHANNEL1_CCL_LUT3_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL1_CCL_LUT4_gc     = (EVSYS_CHANNEL1_CCL_LUT4_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL1_CCL_LUT5_gc     = (EVSYS_CHANNEL1_CCL_LUT5_gv << EVSYS_CHANNEL1_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL1_AC0_OUT_gc      = (EVSYS_CHANNEL1_AC0_OUT_gv << EVSYS_CHANNEL1_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL1_AC1_OUT_gc      = (EVSYS_CHANNEL1_AC1_OUT_gv << EVSYS_CHANNEL1_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL1_AC2_OUT_gc      = (EVSYS_CHANNEL1_AC2_OUT_gv << EVSYS_CHANNEL1_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL1_ADC0_RESRDY_gc  = (EVSYS_CHANNEL1_ADC0_RESRDY_gv << EVSYS_CHANNEL1_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL1_PTC_RESRDY_gc   = (EVSYS_CHANNEL1_PTC_RESRDY_gv << EVSYS_CHANNEL1_gp),  /* PTC Result Ready */
    EVSYS_CHANNEL1_ZCD0_gc         = (EVSYS_CHANNEL1_ZCD0_gv << EVSYS_CHANNEL1_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL1_ZCD1_gc         = (EVSYS_CHANNEL1_ZCD1_gv << EVSYS_CHANNEL1_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL1_PORTA_PIN0_gc   = (EVSYS_CHANNEL1_PORTA_PIN0_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 0 */
    EVSYS_CHANNEL1_PORTA_PIN1_gc   = (EVSYS_CHANNEL1_PORTA_PIN1_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 1 */
    EVSYS_CHANNEL1_PORTA_PIN2_gc   = (EVSYS_CHANNEL1_PORTA_PIN2_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 2 */
    EVSYS_CHANNEL1_PORTA_PIN3_gc   = (EVSYS_CHANNEL1_PORTA_PIN3_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 3 */
    EVSYS_CHANNEL1_PORTA_PIN4_gc   = (EVSYS_CHANNEL1_PORTA_PIN4_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 4 */
    EVSYS_CHANNEL1_PORTA_PIN5_gc   = (EVSYS_CHANNEL1_PORTA_PIN5_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 5 */
    EVSYS_CHANNEL1_PORTA_PIN6_gc   = (EVSYS_CHANNEL1_PORTA_PIN6_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 6 */
    EVSYS_CHANNEL1_PORTA_PIN7_gc   = (EVSYS_CHANNEL1_PORTA_PIN7_gv << EVSYS_CHANNEL1_gp),  /* Port A Pin 7 */
    EVSYS_CHANNEL1_PORTB_PIN0_gc   = (EVSYS_CHANNEL1_PORTB_PIN0_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 0 */
    EVSYS_CHANNEL1_PORTB_PIN1_gc   = (EVSYS_CHANNEL1_PORTB_PIN1_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 1 */
    EVSYS_CHANNEL1_PORTB_PIN2_gc   = (EVSYS_CHANNEL1_PORTB_PIN2_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 2 */
    EVSYS_CHANNEL1_PORTB_PIN3_gc   = (EVSYS_CHANNEL1_PORTB_PIN3_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 3 */
    EVSYS_CHANNEL1_PORTB_PIN4_gc   = (EVSYS_CHANNEL1_PORTB_PIN4_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 4 */
    EVSYS_CHANNEL1_PORTB_PIN5_gc   = (EVSYS_CHANNEL1_PORTB_PIN5_gv << EVSYS_CHANNEL1_gp),  /* Port B Pin 5 */
    EVSYS_CHANNEL1_USART0_XCK_gc   = (EVSYS_CHANNEL1_USART0_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL1_USART1_XCK_gc   = (EVSYS_CHANNEL1_USART1_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL1_USART2_XCK_gc   = (EVSYS_CHANNEL1_USART2_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL1_USART3_XCK_gc   = (EVSYS_CHANNEL1_USART3_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL1_USART4_XCK_gc   = (EVSYS_CHANNEL1_USART4_XCK_gv << EVSYS_CHANNEL1_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL1_SPI0_SCK_gc     = (EVSYS_CHANNEL1_SPI0_SCK_gv << EVSYS_CHANNEL1_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL1_SPI1_SCK_gc     = (EVSYS_CHANNEL1_SPI1_SCK_gv << EVSYS_CHANNEL1_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL1_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL1_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL1_TCA0_HUNF_gc    = (EVSYS_CHANNEL1_TCA0_HUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL1_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL1_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL1_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL1_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL1_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL1_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL1_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL1_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL1_TCA1_HUNF_gc    = (EVSYS_CHANNEL1_TCA1_HUNF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL1_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL1_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL1_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL1_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL1_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL1_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL1_TCB0_CAPT_gc    = (EVSYS_CHANNEL1_TCB0_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL1_TCB0_OVF_gc     = (EVSYS_CHANNEL1_TCB0_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL1_TCB1_CAPT_gc    = (EVSYS_CHANNEL1_TCB1_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL1_TCB1_OVF_gc     = (EVSYS_CHANNEL1_TCB1_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL1_TCB2_CAPT_gc    = (EVSYS_CHANNEL1_TCB2_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL1_TCB2_OVF_gc     = (EVSYS_CHANNEL1_TCB2_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL1_TCB3_CAPT_gc    = (EVSYS_CHANNEL1_TCB3_CAPT_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL1_TCB3_OVF_gc     = (EVSYS_CHANNEL1_TCB3_OVF_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL1_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL1_TCD0_CMPBCLR_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL1_TCD0_CMPASET_gc = (EVSYS_CHANNEL1_TCD0_CMPASET_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL1_TCD0_CMPBSET_gc = (EVSYS_CHANNEL1_TCD0_CMPBSET_gv << EVSYS_CHANNEL1_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL1_TCD0_PROGEV_gc  = (EVSYS_CHANNEL1_TCD0_PROGEV_gv << EVSYS_CHANNEL1_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL1_t;

